# Module Feedback

This system records the responses of students on their learning experience at university.

![rel](https://sqlzoo.net/w/images/7/71/Module-feedback.png)

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1. Find the student name from a matriculation number

**Find the name of the student with number 50200100**

In [2]:
%%sql
SELECT "SPR_FNM1", "SPR_SURN"
  FROM "INS_SPR"
    WHERE "SPR_CODE"='50200100';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[('Tom', 'Cotton')]

## 2. Find the modules studied by a student

**Show the module code and module name for modules studied by the student with number 50200100 in session 2016/7 TR1**

In [3]:
%%sql
SELECT "CAM_SMO"."MOD_CODE", "INS_MOD"."MOD_NAME"
  FROM "INS_MOD" JOIN "CAM_SMO" ON ("INS_MOD"."MOD_CODE"="CAM_SMO"."MOD_CODE")
    WHERE "CAM_SMO"."SPR_CODE"='50200100'
    AND "CAM_SMO"."AYR_CODE"='2016/7'
    AND "CAM_SMO"."PSL_CODE"='TR1';

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('CSN08101', 'Systems and Services'),
 ('INF08104', 'Database Systems'),
 ('SET08108', 'Software Development 2')]

## 3. Find the modules and module leader studied by a student

**Show the module code and module name and details of the module leader for modules studied by the student with number 50200100 in session 2016/7 TR1**

In [4]:
%%sql
SELECT "CAM_SMO"."MOD_CODE", "INS_MOD"."MOD_NAME",
       "INS_PRS"."PRS_CODE", "INS_PRS"."PRS_FNM1", "INS_PRS"."PRS_SURN"
    FROM "CAM_SMO" JOIN "INS_MOD" ON ("INS_MOD"."MOD_CODE"="CAM_SMO"."MOD_CODE")
            JOIN "INS_PRS" ON ("INS_MOD"."PRS_CODE"="INS_PRS"."PRS_CODE")
        WHERE "CAM_SMO"."SPR_CODE"='50200100'
        AND "CAM_SMO"."AYR_CODE"='2016/7'
        AND "CAM_SMO"."PSL_CODE"='TR1';

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('CSN08101', 'Systems and Services', '40000008', 'James', 'Jackson'),
 ('INF08104', 'Database Systems', '40000036', 'Andrew', 'Cumming'),
 ('SET08108', 'Software Development 2', '40000408', 'Neil', 'Urquhart')]

## 4. Show the scores for module SET08108

**Show the Percentage of students who gave 4 or 5 to module SET08108 in session 2016/7 TR1**

(note that this is not real data, these responses were randomly generated)

In [5]:
%%sql
SELECT "INS_RES"."QUE_CODE", "QUE_TEXT", "CAT_NAME",
       ROUND(100*SUM(FLOOR("RES_VALU"/4))/COUNT(1)) AS score
    FROM "INS_RES" JOIN "INS_QUE" ON "INS_RES"."QUE_CODE"="INS_QUE"."QUE_CODE"
               JOIN "INS_CAT" ON "INS_QUE"."CAT_CODE"="INS_CAT"."CAT_CODE"
        WHERE "INS_RES"."MOD_CODE"='SET08108'
        AND "INS_RES"."AYR_CODE"='2016/7'
        AND "INS_RES"."PSL_CODE"='TR1'
        GROUP BY "INS_RES"."QUE_CODE", "QUE_TEXT", "CAT_NAME"
        ORDEr BY "INS_RES"."QUE_CODE";

 * postgresql://postgres:***@localhost/sqlzoo
19 rows affected.

[('1.1', 'Staff are good at explaining things.', 'Learning and Teaching', 89.0),
 ('1.2', 'Staff made the subject interesting.', 'Learning and Teaching', 82.0),
 ('1.3', 'The module was intellectually stimulating.', 'Learning and Teaching', 82.0),
 ('1.4', 'The aims and objectives were clearly stated.', 'Learning and Teaching', 89.0),
 ('1.5', 'The module was well-organised and ran smoothly.', 'Learning and Teaching', 78.0),
 ('1.6', 'The pace was appropriate.', 'Learning and Teaching', 80.0),
 ('1.7', 'The level was appropriate.', 'Learning and Teaching', 82.0),
 ('1.8', 'The workload was managable.', 'Learning and Teaching', 78.0),
 ('1.9', 'I was able to contact module staff when I needed to.', 'Learning and Teaching', 76.0),
 ('2.1', 'The assessment requirements were clearly stated.', 'Assessment and Feedback', 84.0),
 ('2.2', 'The criteria for marking was made clear to me.', 'Assessment and Feedback', 82.0),
 ('2.3', 'I was well supported for the assessment.', 'Assessment and Feedback', 80.0),
 ('2.4', 'I was provided with feedback that aided understanding.', 'Assessment and Feedback', 80.0),
 ('2.5', 'Feedback was provided within three weeks of submission.', 'Assessment and Feedback', 80.0),
 ('3.1', 'The module was well supported by moodle.', 'Learning Resources', 73.0),
 ('3.2', 'The library resources met my needs.', 'Learning Resources', 82.0),
 ('3.3', 'The IT resources met my needs.', 'Learning Resources', 89.0),
 ('3.4', 'The rooms/facilities were of good quality.', 'Learning Resources', 78.0),
 ('4.1', 'I was statisfied with the module.', 'Overall', 89.0)]

## 5. Show the frequency chart for module SET08108 for question 4.1

**For each response 1-5 show the number of students who gave that response (Module SET08108, 2016/7, TR1)**

(note that this is not real data, these responses were randomly generated)

In [6]:
%%sql
SELECT "MOD_CODE", "RES_VALU", COUNT(1)
  FROM "INS_RES"
    WHERE "INS_RES"."MOD_CODE" = 'SET08108'
    AND "INS_RES"."AYR_CODE"='2016/7'
    AND "INS_RES"."PSL_CODE"='TR1'
    AND "INS_RES"."QUE_CODE"='4.1'
GROUP BY "MOD_CODE", "RES_VALU";

 * postgresql://postgres:***@localhost/sqlzoo
3 rows affected.

[('SET08108', 2, 6), ('SET08108', 4, 10), ('SET08108', 5, 39)]